# GetUnits Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
Document..::..GetUnits Method
Document Class See Also
---
Gets the Units object.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public Units GetUnits()
```

Visual Basic
---
```text
Public Function GetUnits As Units
```

Visual C++
---
```text
public:
Units^ GetUnits()
```

# ### Return Value
The Units object.
# See Also
Document Class
Autodesk.Revit.DB Namespace